lib/xml/getReasonCodeByType.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:getReasonCodeByType>
            <!--Optional:-->
            <reasonCodeName>?</reasonCodeName>
            <!--Optional:-->
            <type>?</type>
        </ser:getReasonCodeByType>
    </soapenv:Body>
</soapenv:Envelope>